module @jit_train_step attributes {mhlo.num_partitions = 4 : i32, mhlo.num_replicas = 1 : i32} {
  sdy.mesh @mesh = <["dp"=4]>
  sdy.mesh @empty_mesh = <[]>
  func.func public @main(%arg0: tensor<30522x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg1: tensor<512x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg2: tensor<2x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg3: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg4: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg5: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg6: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg7: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg8: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg9: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg10: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg11: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg12: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg13: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg14: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg15: tensor<12x3072x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg16: tensor<12x3072xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg17: tensor<12x768x3072xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg18: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg19: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg20: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg21: tensor<768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg22: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg23: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg24: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg25: tensor<30522x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg26: tensor<30522xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg27: tensor<i32> {sdy.sharding = #sdy.sharding<@empty_mesh, []>}, %arg28: tensor<30522x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg29: tensor<512x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg30: tensor<2x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg31: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg32: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg33: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg34: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg35: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg36: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg37: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg38: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg39: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg40: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg41: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg42: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg43: tensor<12x3072x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg44: tensor<12x3072xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg45: tensor<12x768x3072xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg46: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg47: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg48: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg49: tensor<768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg50: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg51: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg52: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg53: tensor<30522x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg54: tensor<30522xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg55: tensor<30522x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg56: tensor<512x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg57: tensor<2x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg58: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg59: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg60: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg61: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg62: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg63: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg64: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg65: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg66: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg67: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg68: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg69: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg70: tensor<12x3072x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg71: tensor<12x3072xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg72: tensor<12x768x3072xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg73: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg74: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg75: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg76: tensor<768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg77: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg78: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg79: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg80: tensor<30522x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg81: tensor<30522xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg82: tensor<i32> {sdy.sharding = #sdy.sharding<@empty_mesh, []>}, %arg83: tensor<64x512xi32> {sdy.sharding = #sdy.sharding<@mesh, [{"dp"}, {}]>}, %arg84: tensor<64x512xi32> {sdy.sharding = #sdy.sharding<@mesh, [{"dp"}, {}]>}, %arg85: tensor<64x512xi32> {sdy.sharding = #sdy.sharding<@mesh, [{"dp"}, {}]>}, %arg86: tensor<64x512xi32> {sdy.sharding = #sdy.sharding<@mesh, [{"dp"}, {}]>}, %arg87: tensor<2xui32>) -> (tensor<i32> {jax.result_info = "result[0]"}, tensor<30522x768xbf16> {jax.result_info = "result[1][0].bert.embeddings.word_embeddings.weight"}, tensor<512x768xbf16> {jax.result_info = "result[1][0].bert.embeddings.position_embeddings.weight"}, tensor<2x768xbf16> {jax.result_info = "result[1][0].bert.embeddings.token_type_embeddings.weight"}, tensor<768xbf16> {jax.result_info = "result[1][0].bert.embeddings.layer_norm.weight"}, tensor<768xbf16> {jax.result_info = "result[1][0].bert.embeddings.layer_norm.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.self_attention.query.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.self_attention.query.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.self_attention.key.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.self_attention.key.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.self_attention.value.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.self_attention.value.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.output.dense.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.output.dense.bias"}, tensor<12x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.output.layer_norm.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.output.layer_norm.bias"}, tensor<12x3072x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.intermediate.dense.weight"}, tensor<12x3072xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.intermediate.dense.bias"}, tensor<12x768x3072xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.output.dense.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.output.dense.bias"}, tensor<12x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.output.layer_norm.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.output.layer_norm.bias"}, tensor<768x768xbf16> {jax.result_info = "result[1][0].mlm_head.dense.weight"}, tensor<768xbf16> {jax.result_info = "result[1][0].mlm_head.dense.bias"}, tensor<768xbf16> {jax.result_info = "result[1][0].mlm_head.layer_norm.weight"}, tensor<768xbf16> {jax.result_info = "result[1][0].mlm_head.layer_norm.bias"}, tensor<30522x768xbf16> {jax.result_info = "result[1][0].mlm_head.lm_head.pytree[0].weight"}, tensor<30522xbf16> {jax.result_info = "result[1][0].mlm_head.bias"}, tensor<i32> {jax.result_info = "result[1][1].opt_state[1][0].count"}, tensor<30522x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.embeddings.word_embeddings.weight"}, tensor<512x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.embeddings.position_embeddings.weight"}, tensor<2x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.embeddings.token_type_embeddings.weight"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.embeddings.layer_norm.weight"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.embeddings.layer_norm.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.encoder.layers.attention.self_attention.query.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.encoder.layers.attention.self_attention.query.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.encoder.layers.attention.self_attention.key.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.encoder.layers.attention.self_attention.key.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.encoder.layers.attention.self_attention.value.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.encoder.layers.attention.self_attention.value.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.encoder.layers.attention.output.dense.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.encoder.layers.attention.output.dense.bias"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.encoder.layers.attention.output.layer_norm.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.encoder.layers.attention.output.layer_norm.bias"}, tensor<12x3072x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.encoder.layers.intermediate.dense.weight"}, tensor<12x3072xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.encoder.layers.intermediate.dense.bias"}, tensor<12x768x3072xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.encoder.layers.output.dense.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.encoder.layers.output.dense.bias"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.encoder.layers.output.layer_norm.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.bert.encoder.layers.output.layer_norm.bias"}, tensor<768x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.mlm_head.dense.weight"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.mlm_head.dense.bias"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.mlm_head.layer_norm.weight"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.mlm_head.layer_norm.bias"}, tensor<30522x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.mlm_head.lm_head.pytree[0].weight"}, tensor<30522xbf16> {jax.result_info = "result[1][1].opt_state[1][0].mu.mlm_head.bias"}, tensor<30522x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.embeddings.word_embeddings.weight"}, tensor<512x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.embeddings.position_embeddings.weight"}, tensor<2x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.embeddings.token_type_embeddings.weight"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.embeddings.layer_norm.weight"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.embeddings.layer_norm.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.encoder.layers.attention.self_attention.query.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.encoder.layers.attention.self_attention.query.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.encoder.layers.attention.self_attention.key.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.encoder.layers.attention.self_attention.key.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.encoder.layers.attention.self_attention.value.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.encoder.layers.attention.self_attention.value.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.encoder.layers.attention.output.dense.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.encoder.layers.attention.output.dense.bias"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.encoder.layers.attention.output.layer_norm.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.encoder.layers.attention.output.layer_norm.bias"}, tensor<12x3072x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.encoder.layers.intermediate.dense.weight"}, tensor<12x3072xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.encoder.layers.intermediate.dense.bias"}, tensor<12x768x3072xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.encoder.layers.output.dense.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.encoder.layers.output.dense.bias"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.encoder.layers.output.layer_norm.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.bert.encoder.layers.output.layer_norm.bias"}, tensor<768x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.mlm_head.dense.weight"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.mlm_head.dense.bias"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.mlm_head.layer_norm.weight"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.mlm_head.layer_norm.bias"}, tensor<30522x768xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.mlm_head.lm_head.pytree[0].weight"}, tensor<30522xbf16> {jax.result_info = "result[1][1].opt_state[1][0].nu.mlm_head.bias"}, tensor<i32> {jax.result_info = "result[1][1].opt_state[1][2].count"}, tensor<i32> {jax.result_info = "result[1][2]['acc'][0]"}, tensor<i32> {jax.result_info = "result[1][2]['acc'][1]"}, tensor<f32> {jax.result_info = "result[1][2]['loss'][0]"}, tensor<i32> {jax.result_info = "result[1][2]['loss'][1]"}, tensor<i32> {jax.result_info = "result[1][2]['total_token']"}) {
    %0 = call @_threefry_split(%arg87) : (tensor<2xui32>) -> tensor<2x2xui32>
    %1 = stablehlo.slice %0 [1:2, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %2 = stablehlo.reshape %1 : (tensor<1x2xui32>) -> tensor<2xui32>
    %3 = stablehlo.iota dim = 0 : tensor<512xi32>
    %4 = stablehlo.broadcast_in_dim %3, dims = [1] : (tensor<512xi32>) -> tensor<1x512xi32>
    %5 = stablehlo.broadcast_in_dim %4, dims = [0, 1] : (tensor<1x512xi32>) -> tensor<64x512xi32>
    %6 = call @_threefry_split(%2) : (tensor<2xui32>) -> tensor<2x2xui32>
    %7 = stablehlo.slice %6 [0:1, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %8 = stablehlo.reshape %7 : (tensor<1x2xui32>) -> tensor<2xui32>
    %9 = call @_threefry_split(%8) : (tensor<2xui32>) -> tensor<2x2xui32>
    %10 = stablehlo.slice %9 [0:1, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %11 = stablehlo.reshape %10 : (tensor<1x2xui32>) -> tensor<2xui32>
    %12 = stablehlo.slice %9 [1:2, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %13 = stablehlo.reshape %12 : (tensor<1x2xui32>) -> tensor<2xui32>
    %14:2 = call @_take(%arg0, %arg83) : (tensor<30522x768xbf16>, tensor<64x512xi32>) -> (tensor<64x512x768xbf16>, tensor<64x512x1xi32>)
    %15:2 = call @_take_15(%arg1, %5) : (tensor<512x768xbf16>, tensor<64x512xi32>) -> (tensor<64x512x768xbf16>, tensor<64x512x1xi32>)
    %16 = stablehlo.add %14#0, %15#0 : tensor<64x512x768xbf16>
    %17:2 = call @_take_29(%arg2, %arg85) : (tensor<2x768xbf16>, tensor<64x512xi32>) -> (tensor<64x512x768xbf16>, tensor<64x512x1xi32>)
    %18 = stablehlo.add %16, %17#0 : tensor<64x512x768xbf16>
    %19 = stablehlo.convert %18 : (tensor<64x512x768xbf16>) -> tensor<64x512x768xf32>
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %20 = stablehlo.reduce(%19 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<64x512x768xf32>, tensor<f32>) -> tensor<64x512xf32>
    %21 = stablehlo.broadcast_in_dim %20, dims = [0, 1] : (tensor<64x512xf32>) -> tensor<64x512x1xf32>
    %cst_0 = stablehlo.constant dense<7.680000e+02> : tensor<f32>
    %22 = stablehlo.broadcast_in_dim %cst_0, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %23 = stablehlo.divide %21, %22 : tensor<64x512x1xf32>
    %24 = stablehlo.convert %23 : (tensor<64x512x1xf32>) -> tensor<64x512x1xbf16>
    %c = stablehlo.constant dense<0> : tensor<i32>
    %25:4 = call @_var(%18, %c) : (tensor<64x512x768xbf16>, tensor<i32>) -> (tensor<64x512x1xbf16>, tensor<64x512x768xf32>, tensor<f32>, tensor<i1>)
    %cst_1 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %26 = stablehlo.broadcast_in_dim %cst_1, dims = [] : (tensor<bf16>) -> tensor<64x512x1xbf16>
    %27 = stablehlo.maximum %25#0, %26 : tensor<64x512x1xbf16>
    %28 = stablehlo.compare  EQ, %25#0, %27,  FLOAT : (tensor<64x512x1xbf16>, tensor<64x512x1xbf16>) -> tensor<64x512x1xi1>
    %cst_2 = stablehlo.constant dense<1.000000e+00> : tensor<bf16>
    %29 = stablehlo.broadcast_in_dim %cst_2, dims = [] : (tensor<bf16>) -> tensor<64x512x1xbf16>
    %cst_3 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %30 = stablehlo.broadcast_in_dim %cst_3, dims = [] : (tensor<bf16>) -> tensor<64x512x1xbf16>
    %31 = stablehlo.select %28, %29, %30 : tensor<64x512x1xi1>, tensor<64x512x1xbf16>
    %cst_4 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %32 = stablehlo.broadcast_in_dim %cst_4, dims = [] : (tensor<bf16>) -> tensor<64x512x1xbf16>
    %33 = stablehlo.compare  EQ, %32, %27,  FLOAT : (tensor<64x512x1xbf16>, tensor<64x512x1xbf16>) -> tensor<64x512x1xi1>
    %cst_5 = stablehlo.constant dense<2.000000e+00> : tensor<bf16>
    %34 = stablehlo.broadcast_in_dim %cst_5, dims = [] : (tensor<bf16>) -> tensor<64x512x1xbf16>
    %cst_6 = stablehlo.constant dense<1.000000e+00> : tensor<bf16>
    %35 = stablehlo.broadcast_in_dim %cst_6, dims = [] : (tensor<bf16>) -> tensor<64x512x1xbf16>
    %36 = stablehlo.select %33, %34, %35 : tensor<64x512x1xi1>, tensor<64x512x1xbf16>
    %37 = stablehlo.divide %31, %36 : tensor<64x512x1xbf16>
    %cst_7 = stablehlo.constant dense<1.001870e-12> : tensor<bf16>
    %38 = stablehlo.broadcast_in_dim %cst_7, dims = [] : (tensor<bf16>) -> tensor<64x512x1xbf16>
    %39 = stablehlo.add %27, %38 : tensor<64x512x1xbf16>
    %40 = stablehlo.rsqrt %39 : tensor<64x512x1xbf16>
    %41 = stablehlo.divide %40, %39 : tensor<64x512x1xbf16>
    %cst_8 = stablehlo.constant dense<-5.000000e-01> : tensor<bf16>
    %42 = stablehlo.broadcast_in_dim %cst_8, dims = [] : (tensor<bf16>) -> tensor<64x512x1xbf16>
    %43 = stablehlo.multiply %42, %41 : tensor<64x512x1xbf16>
    %44 = stablehlo.broadcast_in_dim %24, dims = [0, 1, 2] : (tensor<64x512x1xbf16>) -> tensor<64x512x768xbf16>
    %45 = stablehlo.subtract %18, %44 : tensor<64x512x768xbf16>
    %46 = stablehlo.broadcast_in_dim %40, dims = [0, 1, 2] : (tensor<64x512x1xbf16>) -> tensor<64x512x768xbf16>
    %47 = stablehlo.multiply %45, %46 : tensor<64x512x768xbf16>
    %48 = stablehlo.broadcast_in_dim %arg3, dims = [2] : (tensor<768xbf16>) -> tensor<1x1x768xbf16>
    %49 = stablehlo.broadcast_in_dim %48, dims = [0, 1, 2] : (tensor<1x1x768xbf16>) -> tensor<64x512x768xbf16>
    %50 = stablehlo.multiply %49, %47 : tensor<64x512x768xbf16>
    %51 = stablehlo.broadcast_in_dim %arg4, dims = [2] : (tensor<768xbf16>) -> tensor<1x1x768xbf16>
    %52 = stablehlo.broadcast_in_dim %51, dims = [0, 1, 2] : (tensor<1x1x768xbf16>) -> tensor<64x512x768xbf16>
    %53 = stablehlo.add %50, %52 : tensor<64x512x768xbf16>
    %cst_9 = stablehlo.constant dense<0.899999976> : tensor<f32>
    %54 = call @_bernoulli(%11, %cst_9) : (tensor<2xui32>, tensor<f32>) -> tensor<64x512x768xi1>
    %cst_10 = stablehlo.constant dense<8.984370e-01> : tensor<bf16>
    %55 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<bf16>) -> tensor<64x512x768xbf16>
    %56 = stablehlo.divide %53, %55 : tensor<64x512x768xbf16>
    %c_11 = stablehlo.constant dense<0> : tensor<i32>
    %57 = call @_where_68(%54, %56, %c_11) : (tensor<64x512x768xi1>, tensor<64x512x768xbf16>, tensor<i32>) -> tensor<64x512x768xbf16>
    %c_12 = stablehlo.constant dense<true> : tensor<i1>
    %58 = stablehlo.broadcast_in_dim %c_12, dims = [] : (tensor<i1>) -> tensor<512xi1>
    %59 = stablehlo.broadcast_in_dim %58, dims = [1] : (tensor<512xi1>) -> tensor<512x512xi1>
    %60 = stablehlo.broadcast_in_dim %59, dims = [1, 2] : (tensor<512x512xi1>) -> tensor<64x512x512xi1>
    %61 = stablehlo.broadcast_in_dim %arg84, dims = [0, 1] : (tensor<64x512xi32>) -> tensor<64x512x1xi32>
    %62 = stablehlo.convert %60 : (tensor<64x512x512xi1>) -> tensor<64x512x512xi32>
    %63 = stablehlo.broadcast_in_dim %61, dims = [0, 1, 2] : (tensor<64x512x1xi32>) -> tensor<64x512x512xi32>
    %64 = stablehlo.and %62, %63 : tensor<64x512x512xi32>
    %65 = call @_threefry_split_78(%13) : (tensor<2xui32>) -> tensor<12x2xui32>
    %cst_13 = stablehlo.constant dense<6.400000e+01> : tensor<f32>
    %66 = stablehlo.sqrt %cst_13 : tensor<f32>
    %67 = stablehlo.convert %66 : (tensor<f32>) -> tensor<bf16>
    %68 = stablehlo.broadcast_in_dim %64, dims = [0, 1, 3] : (tensor<64x512x512xi32>) -> tensor<64x512x1x512xi32>
    %cst_14 = stablehlo.constant dense<-3.389530e+38> : tensor<bf16>
    %69:2 = call @_where_91(%68, %cst_14) : (tensor<64x512x1x512xi32>, tensor<bf16>) -> (tensor<64x512x12x512xi1>, tensor<64x512x12x512xbf16>)
    %70:2 = call @_bernoulli_95() : () -> (tensor<1x1x1x1xf32>, tensor<1x1x1x1xf32>)
    %c_15 = stablehlo.constant dense<0> : tensor<i32>
    %71 = call @_where_99(%c_15) : (tensor<i32>) -> tensor<64x512x12x512xbf16>
    %72:2 = call @_bernoulli_101() : () -> (tensor<1x1x1xf32>, tensor<1x1x1xf32>)
    %c_16 = stablehlo.constant dense<0> : tensor<i32>
    %73 = call @_where_103(%c_16) : (tensor<i32>) -> tensor<64x512x768xbf16>
    %c_17 = stablehlo.constant dense<0> : tensor<i32>
    %74:3 = call @_var_104(%c_17) : (tensor<i32>) -> (tensor<f32>, tensor<i1>, tensor<64x512x1xbf16>)
    %cst_18 = stablehlo.constant dense<1.000000e+00> : tensor<bf16>
    %75 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<bf16>) -> tensor<64x512x1xbf16>
    %cst_19 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %76 = stablehlo.broadcast_in_dim %cst_19, dims = [] : (tensor<bf16>) -> tensor<64x512x1xbf16>
    %cst_20 = stablehlo.constant dense<2.000000e+00> : tensor<bf16>
    %77 = stablehlo.broadcast_in_dim %cst_20, dims = [] : (tensor<bf16>) -> tensor<64x512x1xbf16>
    %cst_21 = stablehlo.constant dense<1.000000e+00> : tensor<bf16>
    %78 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<bf16>) -> tensor<64x512x1xbf16>
    %cst_22 = stablehlo.constant dense<1.000000e+00> : tensor<bf16>
    %79 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<bf16>) -> tensor<bf16>
    %80:2 = call @_bernoulli_101() : () -> (tensor<1x1x1xf32>, tensor<1x1x1xf32>)
    %c_23 = stablehlo.constant dense<0> : tensor<i32>
    %81 = call @_where_103(%c_23) : (tensor<i32>) -> tensor<64x512x768xbf16>
    %c_24 = stablehlo.constant dense<0> : tensor<i32>
    %82:3 = call @_var_104(%c_24) : (tensor<i32>) -> (tensor<f32>, tensor<i1>, tensor<64x512x1xbf16>)
    %cst_25 = stablehlo.constant dense<1.000000e+00> : tensor<bf16>
    %83 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<bf16>) -> tensor<64x512x1xbf16>
    %cst_26 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %84 = stablehlo.broadcast_in_dim %cst_26, dims = [] : (tensor<bf16>) -> tensor<64x512x1xbf16>
    %cst_27 = stablehlo.constant dense<2.000000e+00> : tensor<bf16>
    %85 = stablehlo.broadcast_in_dim %cst_27, dims = [] : (tensor<bf16>) -> tensor<64x512x1xbf16>
    %cst_28 = stablehlo.constant dense<1.000000e+00> : tensor<bf16>
    %86 = stablehlo.broadcast_in_dim %cst_28, dims = [] : (tensor<bf16>) -> tensor<64x512x1xbf16>
    %cst_29 = stablehlo.constant dense<0.899999976> : tensor<f32>
    %cst_30 = stablehlo.constant dense<0.899999976> : tensor<f32>
    %cst_31 = stablehlo.constant dense<0.899999976> : tensor<f32>
    %cst_32 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %87 = stablehlo.broadcast_in_dim %cst_32, dims = [] : (tensor<bf16>) -> tensor<12x768x768xbf16>
    %cst_33 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %88 = stablehlo.broadcast_in_dim %cst_33, dims = [] : (tensor<bf16>) -> tensor<12x64x512x768xbf16>
    %cst_34 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %89 = stablehlo.broadcast_in_dim %cst_34, dims = [] : (tensor<bf16>) -> tensor<12x768x768xbf16>
    %cst_35 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %90 = stablehlo.broadcast_in_dim %cst_35, dims = [] : (tensor<bf16>) -> tensor<12x768x768xbf16>
    %cst_36 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %91 = stablehlo.broadcast_in_dim %cst_36, dims = [] : (tensor<bf16>) -> tensor<12x64x512x12x64xbf16>
    %cst_37 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %92 = stablehlo.broadcast_in_dim %cst_37, dims = [] : (tensor<bf16>) -> tensor<12x64x512x12x64xbf16>
    %cst_38 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %93 = stablehlo.broadcast_in_dim %cst_38, dims = [] : (tensor<f32>) -> tensor<12x64x512x12x512xf32>
    %cst_39 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %94 = stablehlo.broadcast_in_dim %cst_39, dims = [] : (tensor<f32>) -> tensor<12x64x512x12x1xf32>
    %cst_40 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %95 = stablehlo.broadcast_in_dim %cst_40, dims = [] : (tensor<f32>) -> tensor<12x64x512x12x1xf32>
    %c_41 = stablehlo.constant dense<false> : tensor<i1>
    %96 = stablehlo.broadcast_in_dim %c_41, dims = [] : (tensor<i1>) -> tensor<12x64x512x12x512xi1>
    %cst_42 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %97 = stablehlo.broadcast_in_dim %cst_42, dims = [] : (tensor<bf16>) -> tensor<12x64x512x12x512xbf16>
    %cst_43 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %98 = stablehlo.broadcast_in_dim %cst_43, dims = [] : (tensor<bf16>) -> tensor<12x64x512x12x64xbf16>
    %cst_44 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %99 = stablehlo.broadcast_in_dim %cst_44, dims = [] : (tensor<bf16>) -> tensor<12x768x768xbf16>
    %cst_45 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %100 = stablehlo.broadcast_in_dim %cst_45, dims = [] : (tensor<bf16>) -> tensor<12x64x512x768xbf16>
    %c_46 = stablehlo.constant dense<false> : tensor<i1>
    %101 = stablehlo.broadcast_in_dim %c_46, dims = [] : (tensor<i1>) -> tensor<12x64x512x768xi1>
    %cst_47 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %102 = stablehlo.broadcast_in_dim %cst_47, dims = [] : (tensor<f32>) -> tensor<12x64x512x768xf32>
    %cst_48 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %103 = stablehlo.broadcast_in_dim %cst_48, dims = [] : (tensor<bf16>) -> tensor<12x64x512x1xbf16>
    %cst_49 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %104 = stablehlo.broadcast_in_dim %cst_49, dims = [] : (tensor<bf16>) -> tensor<12x64x512x1xbf16>
    %cst_50 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %105 = stablehlo.broadcast_in_dim %cst_50, dims = [] : (tensor<bf16>) -> tensor<12x64x512x1xbf16>
    %cst_51 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %106 = stablehlo.broadcast_in_dim %cst_51, dims = [] : (tensor<bf16>) -> tensor<12x64x512x768xbf16>
    %cst_52 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %107 = stablehlo.broadcast_in_dim %cst_52, dims = [] : (tensor<bf16>) -> tensor<12x64x512x768xbf16>
    %cst_53 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %108 = stablehlo.broadcast_in_dim %cst_53, dims = [] : (tensor<bf16>) -> tensor<12x1x1x768xbf16>
    %cst_54 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %109 = stablehlo.broadcast_in_dim %cst_54, dims = [] : (tensor<bf16>) -> tensor<12x768x3072xbf16>
    %cst_55 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %110 = stablehlo.broadcast_in_dim %cst_55, dims = [] : (tensor<bf16>) -> tensor<12x64x512x768xbf16>
    %cst_56 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %111 = stablehlo.broadcast_in_dim %cst_56, dims = [] : (tensor<bf16>) -> tensor<12x64x512x3072xbf16>
    %cst_57 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %112 = stablehlo.broadcast_in_dim %cst_57, dims = [] : (tensor<bf16>) -> tensor<12x64x512x3072xbf16>
    %cst_58 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %113 = stablehlo.broadcast_in_dim %cst_58, dims = [] : (tensor<bf16>) -> tensor<12x64x512x3072xbf16>
    %cst_59 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %114 = stablehlo.broadcast_in_dim %cst_59, dims = [] : (tensor<bf16>) -> tensor<12x64x512x3072xbf16>
    %cst_60 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %115 = stablehlo.broadcast_in_dim %cst_60, dims = [] : (tensor<bf16>) -> tensor<12x64x512x3072xbf16>
    %cst_61 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %116 = stablehlo.broadcast_in_dim %cst_61, dims = [] : (tensor<bf16>) -> tensor<12x3072x768xbf16>
    %cst_62 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %117 = stablehlo.broadcast_in_dim %cst_62, dims = [] : (tensor<bf16>) -> tensor<12x64x512x3072xbf16>
    %c_63 = stablehlo.constant dense<false> : tensor<i1>
    %118 = stablehlo.broadcast_in_dim %c_63, dims = [] : (tensor<i1>) -> tensor<12x64x512x768xi1>
    %cst_64 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %119 = stablehlo.broadcast_in_dim %cst_64, dims = [] : (tensor<f32>) -> tensor<12x64x512x768xf32>
    %cst_65 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %120 = stablehlo.broadcast_in_dim %cst_65, dims = [] : (tensor<bf16>) -> tensor<12x64x512x1xbf16>
    %cst_66 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %121 = stablehlo.broadcast_in_dim %cst_66, dims = [] : (tensor<bf16>) -> tensor<12x64x512x1xbf16>
    %cst_67 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %122 = stablehlo.broadcast_in_dim %cst_67, dims = [] : (tensor<bf16>) -> tensor<12x64x512x1xbf16>
    %cst_68 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %123 = stablehlo.broadcast_in_dim %cst_68, dims = [] : (tensor<bf16>) -> tensor<12x64x512x768xbf16>
    %cst_69 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %124 = stablehlo.broadcast_in_dim %cst_69, dims = [] : (tensor<bf16>) -> tensor<12x64x512x768xbf16>
    %cst_70 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %125 = stablehlo.broadcast_in_dim %cst_70, dims = [] : (tensor<bf16>) -> tensor<12x1x1x768xbf16>
    %c_71 = stablehlo.constant dense<0> : tensor<i32>
    %126:88 = stablehlo.while(%iterArg = %arg5, %iterArg_416 = %arg6, %iterArg_417 = %arg7, %iterArg_418 = %arg8, %iterArg_419 = %arg9, %iterArg_420 = %arg10, %iterArg_421 = %arg11, %iterArg_422 = %arg12, %iterArg_423 = %arg13, %iterArg_424 = %arg14, %iterArg_425 = %arg15, %iterArg_426 = %arg16, %iterArg_427 = %arg17, %iterArg_428 = %arg18, %iterArg_429 = %arg19, %iterArg_430 = %arg20, %iterArg_431 = %65, %iterArg_432 = %80#0, %iterArg_433 = %80#1, %iterArg_434 = %cst_29, %iterArg_435 = %72#0, %iterArg_436 = %72#1, %iterArg_437 = %cst_30, %iterArg_438 = %70#0, %iterArg_439 = %70#1, %iterArg_440 = %cst_31, %iterArg_441 = %67, %iterArg_442 = %69#0, %iterArg_443 = %69#1, %iterArg_444 = %71, %iterArg_445 = %73, %iterArg_446 = %74#0, %iterArg_447 = %74#1, %iterArg_448 = %74#2, %iterArg_449 = %81, %iterArg_450 = %82#0, %iterArg_451 = %82#1, %iterArg_452 = %82#2, %iterArg_453 = %76, %iterArg_454 = %75, %iterArg_455 = %78, %iterArg_456 = %77, %iterArg_457 = %79, %iterArg_458 = %84, %iterArg_459 = %83, %iterArg_460 = %86, %iterArg_461 = %85, %iterArg_462 = %c_71, %iterArg_463 = %57, %iterArg_464 = %87, %iterArg_465 = %88, %iterArg_466 = %89, %iterArg_467 = %90, %iterArg_468 = %91, %iterArg_469 = %92, %iterArg_470 = %93, %iterArg_471 = %94, %iterArg_472 = %95, %iterArg_473 = %96, %iterArg_474 = %97, %iterArg_475 = %98, %iterArg_476 = %99, %iterArg_477 = %100, %iterArg_478 = %101, %iterArg_479 = %102, %iterArg_480 = %103, %iterArg_481 = %104, %iterArg_482 = %105, %iterArg_483 = %106, %iterArg_484 = %107, %iterArg_485 = %108, %iterArg_486 = %109, %iterArg_487 = %110, %iterArg_488 = %111, %iterArg_489 = %112, %iterArg_490 = %113, %iterArg_491 = %114, %iterArg_492 = %115, %iterArg_493 = %116, %iterArg_494 = %117, %iterArg_495 = %118, %iterArg_496 = %119, %iterArg_497 = %120, %iterArg_498 = %121, %iterArg_499 = %122, %iterArg_500 = %123, %iterArg_501 = %124, %iterArg_502 = %125) : tensor<12x768x768xbf16>, tensor<12x768xbf16>, tensor<12x768x768xbf16>, tensor<12x768xbf16>, tensor<12x768x768xbf16>, tensor<12x768xbf16>, tensor<12x768x768xbf16>, tensor<12x768xbf16>, tensor<12x768xbf16>, tensor<12x768xbf16>, tensor<12x3072x768xbf16>, tensor<12x3072xbf16>, tensor<12x768x3072xbf16>, tensor<12x768xbf16>, tensor<12x768xbf16>, tensor<12x768xbf16>, tensor<12x2xui32>, tensor<1x1x1xf32>, tensor<1x1x1xf32>, tensor<f32>, tensor<1x1x1xf32>, tensor<1x1x1xf32>, tensor<f32>, tensor<1x1x1x1xf32>, tensor<1x1x1x1xf32>, tensor<f32>, tensor<bf16>, tensor<64x512x12x512xi1>, tensor<64x512x12x512xbf16>, tensor<64x512x12x512xbf16>, tensor<64x512x768xbf16>, tensor<f32>, tensor<i1>, tensor<64x512x1xbf16>, tensor<64x512x768xbf16>, tensor<f32>, tensor<i1>, tensor<64x512x1xbf16>, tensor<64x512x1xbf16>, tensor<64x512x1xbf16>, tensor<64x512x1xbf16>, tensor<64x512x1xbf16>, tensor<bf16>, tensor<64x512x1xbf16>, tensor<64x512x1xbf16>, tensor<64x512x1xbf16>, tensor<64x512x1xbf16>, tensor<i32>, tensor<64x512x768xbf16>, tensor<12x768x768xbf16>, tensor<12x64x512x768xbf16>, tensor<12x768x768xbf16>, tensor<12x768x768xbf16>, tensor<12x64x512x12x64xbf16>, tensor<12x64x512x12x64xbf16>, tensor<12x64x512x12x512xf32>, tensor<12x64x512x12x1xf32>, tensor<12x64x512x12x1xf32>, tensor<12x64x512x12x512xi1>, tensor<12x64x512x12x512xbf16>, tensor<12x64x512x12x64xbf16>, tensor<12x768x768xbf16>, tensor<12x64x512x768xbf16>, tensor<12x64x512x768xi1>, tensor<12x64x512x768xf32>, tensor<12x64x512x1xbf16>, tensor<12x64x512x1xbf16>, tensor<12x64x512x1xbf16>, tensor<12x64x512x768xbf16>, tensor<12x64x512x768xbf16>, tensor<12x1x1x768xbf16>, tensor<12x768x3072xbf16>, tensor<12x64x512x768xbf16>, tensor<12x64x512x3072xbf16>, tensor<12x64x512x3072xbf16>, tensor<12x64x512x3072xbf16>, tensor<12x64x512x3072xbf16>, tensor<12x64x512x3072xbf16>, tensor<12x3072x768xbf16>, tensor<12x64x512x3072xbf16>, tensor<12x64x512x768xi1>, tensor<12x64x512x768xf32>, tensor<12x64x512x1xbf16>, tensor<12x64x512x1xbf16>, tensor<12x64x512x1xbf16>, tensor<12x64x512x768xbf16>, tensor<12x64x512x768xbf16>, tensor<12x1x1x768xbf16>
    cond {
      %c_503 = stablehlo.constant dense<12> : tensor<i32>
      %1452 = stablehlo.compare  LT, %iterArg_462, %c_503,  SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1>
      stablehlo.return %1452 : tensor<i1>
    } do {
      %c_503 = stablehlo.constant dense<0> : tensor<i32>
      %c_504 = stablehlo.constant dense<0> : tensor<i32>
      %1452 = stablehlo.dynamic_slice %iterArg, %iterArg_462, %c_503, %c_504, sizes = [1, 768, 768] : (tensor<12x768x768xbf16>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<1x768x768xbf16>
      %1453 = stablehlo.reshape %1452 : (tensor<1x768x768xbf16>) -> tensor<768x768xbf16>
      %c_505 = stablehlo.constant dense<0> : tensor<i32>
      %1454 = stablehlo.dynamic_slice %iterArg_416, %iterArg_462, %c_505, sizes = [1, 768] : (tensor<12x768xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x768xbf16>
      %1455 = stablehlo.reshape %1454 : (tensor<1x768xbf16>) -> tensor<768xbf16>
      %c_506 = stablehlo.constant dense<0> : tensor<i32>
      %c_507 = stablehlo.constant dense<0> : tensor<i32>
      %1456 = stablehlo.dynamic_slice %iterArg_417, %iterArg_462, %c_506, %c_507, sizes = [1, 768, 768] : (tensor<12x768x768xbf16>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<1x768x768xbf16>
      %1457 = stablehlo.reshape %1456 : (tensor<1x768x768xbf16>) -> tensor<768x768xbf16>
      %c_508 = stablehlo.constant dense<0> : tensor<i32>
      %1458 = stablehlo.dynamic_slice %iterArg_418, %iterArg_462, %c_508, sizes = [1, 768] : (tensor<12x768xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x768xbf16>
      %1459 = stablehlo.reshape %1458 : (tensor<1x768xbf16>) -> tensor<768xbf16>
      %c_509 = stablehlo.constant dense<0> : tensor<i32>
      %c_510 = stablehlo.constant dense<0> : tensor<i32>
      %1460 = stablehlo.dynamic_slice %iterArg_419, %iterArg_462, %c_509, %c_510, sizes = [1, 768, 768] : (tensor<12x768x768xbf16>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<1x768x768xbf16>
      %1461 = stablehlo.reshape %1460 : (tensor<1x768x768xbf16>) -> tensor<768x768xbf16>
      %c_511 = stablehlo.constant dense<0> : tensor<i32>
      %1462 = stablehlo.dynamic_slice %iterArg_420, %iterArg_462, %c_511, sizes = [1, 768] : (tensor<12x768xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x768xbf16>
      %1463 = stablehlo.reshape %1462 : (tensor<1x768xbf16>) -> tensor<768xbf16>
      %c_512 = stablehlo.constant dense<0> : tensor<i32>
      %c_513 = stablehlo.constant dense<0> : tensor<i32>
      %1464 = stablehlo.dynamic_slice %iterArg_421, %iterArg_462, %c_512, %c_513, sizes = [1, 768, 768] : (tensor<12x768x768xbf16>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<1x768x768xbf16>
      %1465 = stablehlo.reshape %1464 : (tensor<1x768x768xbf16>) -> tensor<768x768xbf16>
      %c_514 = stablehlo.constant dense<0> : tensor<i32>
      %1466 = stablehlo.dynamic_slice %iterArg_422, %iterArg_462, %c_514, sizes = [1, 768] : (tensor<12x768xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x768xbf16>
      %1467 = stablehlo.reshape %1466 : (tensor<1x768xbf16>) -> tensor<768xbf16>
      %c_515 = stablehlo.constant dense<0> : tensor<i32>
      %1468 = stablehlo.dynamic_slice %iterArg_423, %iterArg_462, %c_515, sizes = [1, 768] : (tensor<12x768xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x768xbf16>
      %1469 = stablehlo.reshape %1468 : (tensor<1x768xbf16>) -> tensor<768xbf16>
      %c_516 = stablehlo.constant dense<0> : tensor<i32>
      %1470 = stablehlo.dynamic_slice %iterArg_424, %iterArg_462, %c_516, sizes = [1, 768] : (tensor<12x768xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x768xbf16>
      %1471 = stablehlo.reshape %1470 : (tensor<1x768xbf16>) -> tensor<768xbf16>
      %c_517 = stablehlo.constant dense<0> : tensor<i32>
      %c_518 = stablehlo.constant dense<0> : tensor<i32>
      %1472 = stablehlo.dynamic_slice %iterArg_425, %iterArg_462, %c_517, %c_518, sizes = [1, 3072, 768] : (tensor<12x3072x768xbf16>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<1x3072x768xbf16>
      %1473 = stablehlo.reshape %1472 : (tensor<1x3072x768xbf16>) -> tensor<3072x768xbf16>
      %c_519 = stablehlo.constant dense<0> : tensor<i32>
      %1474 = stablehlo.dynamic_slice %iterArg_426, %iterArg_462, %c_519, sizes = [1, 3072] : (tensor<12x3072xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x3072xbf16>
      %1475 = stablehlo.reshape %1474 : (tensor<1x3072xbf16>) -> tensor<3072xbf16>
      %c_520 = stablehlo.constant dense<0> : tensor<i32>
      %c_521 = stablehlo.constant dense<0> : tensor<i32>
      %1476 = stablehlo.dynamic_slice %iterArg_427, %iterArg_462, %c_520, %c_521, sizes = [1, 768, 3072] : (tensor<12x768x3072xbf16>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<1x768x3072xbf16>
      %1477 = stablehlo.reshape %1476 : (tensor<1x768x3072xbf16>) -> tensor<768x3072xbf16>
      %c_522 = stablehlo.constant dense<0> : tensor<i32>
      %1478 = stablehlo.dynamic_slice %iterArg_428, %iterArg_462, %c_522, sizes = [1, 768] : (tensor<12x768xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x768xbf16>
      %1479 = stablehlo.reshape %1478 : (tensor<1x768xbf16>) -> tensor<768xbf16>
      %c_523 = stablehlo.constant dense<0> : tensor<i32>
      %1480 = stablehlo.dynamic_slice %iterArg_429, %iterArg_462, %c_523, sizes = [1, 768] : (tensor<12x768xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x768xbf16>
      %1481 = stablehlo.reshape %1480 : (tensor<1x768xbf16>) -> tensor<768xbf16>
      %c_524 = stablehlo.constant dense<0> : tensor<i32>
      %1482 = stablehlo.dynamic_slice %iterArg_430, %iterArg_462, %c_524, sizes = [1, 768] : (tensor<12x768xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x768xbf16>
      %1483 = stablehlo.reshape %1482 : (tensor<1x768xbf16>) -> tensor<768xbf16>
      %c_525 = stablehlo.constant dense<0> : tensor<i32>
      %1484 = stablehlo.dynamic_slice %iterArg_431, %iterArg_462, %c_525, sizes = [1, 2] : (tensor<12x2xui32>, tensor<i32>, tensor<i32>) -> tensor<1x2xui32>
      %1485 = stablehlo.reshape %1484 : (tensor<1x2xui32>) -> tensor<2xui32>
      %1486:40 = func.call @closed_call(%iterArg_432, %iterArg_433, %iterArg_434, %iterArg_435, %iterArg_436, %iterArg_437, %iterArg_438, %iterArg_439, %iterArg_440, %iterArg_441, %iterArg_442, %iterArg_443, %iterArg_444, %iterArg_445, %iterArg_446, %iterArg_447, %iterArg_448, %iterArg_449, %iterArg_450, %iterArg_451, %iterArg_452, %iterArg_453, %iterArg_454, %iterArg_455, %iterArg_456, %iterArg_457, %iterArg_458, %iterArg_459, %iterArg_460, %iterArg_461, %iterArg_463, %1453, %1455, %1457, %1459, %1461, %1463, %1465, %1467, %1469, %1471, %1473, %1475, %1477, %1479, %1481, %1483, %1485) : (tensor<1x1x1xf32>, tensor<1x1x1xf32>, tensor<f32>, tensor<1x1x1xf32>, tensor<1x1x1xf32>, tensor<f32>, tensor<1x1x1x1xf32>, tensor<1x1x1x1xf32>, tensor<f32>, tensor<bf16>, tensor<64x512x12x512xi1>, tensor<64x512x12x512xbf16>, tensor<64x512x12x512xbf16>, tensor<64x512x768xbf16>, tensor<f32>, tensor<i1>, tensor<64x512x1xbf16>, tensor<64x512x768xbf16>, tensor<f32>, tensor<i1>, tensor<64x512x1xbf16>, tensor<64x512x1xbf16>, tensor<64x512x1xbf16>, tensor<64x512x1xbf16>, tensor<64x512x1xbf16>, tensor<bf16>, tensor<64x512x1xbf16>, tensor<64x512x1xbf16>, tensor<64x512x1xbf16>, tensor<64x512x1xbf16>, tensor<64x512x768xbf16>, tensor<768x768xbf16>, tensor<768xbf16>, tensor<768x768xbf16>, tensor<768xbf16>, tensor<768x768xbf16>, tensor<768xbf16>, tensor<768x768xbf16>, tensor<768xbf16>, tensor<768xbf16>, tensor<768xbf16>, tensor<3072x768xbf16>, tensor<3072xbf16>, tensor<768x3072xbf16>, tensor<768xbf16>, tensor<768xbf16>, tensor<768xbf16>, tensor<2xui32>) -> (tensor<64x512x768xbf16>, tensor<768x768xbf16>, tensor<64x512x768xbf16>, tensor<768x768xbf16>, tensor<768x768xbf16>, tensor<64x512x12x64xbf16>, tensor<64x512x12x64xbf16>, tensor<64x512x12x512xf32>, tensor<64x512x12x1xf32>, tensor<64x512x12x1xf32>, tensor<64x512x12x512xi1>, tensor<64x512x12x512xbf16>, tensor<64x512x12x64xbf16>, tensor<768x768xbf16>, tensor<64x512x768xbf16>, tensor<64x512x768xi1>, tensor<64x512x768xf32>, tensor<64x512x1xbf16>, tensor<64x512x1xbf16>, tensor<64x512x1xbf16>, tensor<64x512x768xbf16>, tensor<64x512x768xbf16>, tensor<1x1x768xbf16>, tensor<768x3072xbf16>, tensor<64x512x768xbf16>, tensor<64x512x3072xbf16>, tensor<64x512x3072xbf16>, tensor<64x512x3072xbf16>, tensor<64x512x3072xbf16>, tensor<64x512x3072xbf16>, tensor<3072x768xbf16>, tensor<64x512x3072xbf16>, tensor<64x512x768xi1>, tensor<64x512x768xf32>, tensor<64x512x1xbf16>, tensor<64x512x1xbf16>, tensor<64x512x1xbf16>, tensor<64x512x768xbf16>, tensor<64x512x768xbf16>, tensor<1x1x768xbf16>)
      %1487 = stablehlo.broadcast_in_dim %1486#1, dims = [1, 2] : (tensor<768x768xbf16>) -> tensor<1x768x768xbf16>
      %c_526 = stablehlo.constant dense<0> : tensor<i32>
      %c_527 = stablehlo.constant dense<0> : tensor<i32>
      %1488 = stablehlo.dynamic_update_slice %iterArg_464, %1487, %iterArg_462, %c_526, %c_527 : (tensor<12x768x768xbf16>, tensor<1x768x768xbf16>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<12x768x768xbf16>
      %1489 = stablehlo.broadcast_in_dim %1486#2, dims = [1, 2, 3] : (tensor<64x512x768xbf16>) -> tensor<1x64x512x768xbf16>
      %c_528 = stablehlo.constant dense<0> : tensor<i32>
      %c_529 = stablehlo.constant dense<0> : tensor<i32>
      %c_530 = stablehlo.constant dense<0> : tensor<i32>
      %1490 = stablehlo.dynamic_update_slice %iterArg_465, %1489, %iterArg_462, %c_528, %c_529, %c_530 : (tensor<12x64x512x768xbf16>, tensor<1x64x512x768xbf16>, tensor<i32>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<12x64x512x768xbf16>
      %1491 = stablehlo.broadcast_in_dim %1486#3, dims = [1, 2] : (tensor<768x768xbf16>) -> tensor<1x768x768xbf16>
      %c_531 = stablehlo.constant dense<0> : tensor<i32>
      %c_532 = stablehlo.constant dense<0> : tensor<i32>
      %1492 = stablehlo.dynamic_update_slice %iterArg_466, %1491, %iterArg_462, %c_531, %c_532 : (tensor<12x768x768xbf16>, tensor<1x768x768xbf16>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<12x768x768xbf16>
      %1493 = stablehlo.broadcast_in_dim %1486#4, dims = [1, 2] : (tensor<768x768xbf16>) -> tensor<1x768x768xbf16>
      %c_533 = stablehlo.constant dense<0> : tensor<i32>
      %c_534 = stablehlo.constant dense<0> : tensor<i32>
      %1494 = stablehlo.dynamic_update_slice %iterArg_467, %1493, %iterArg_462, %c_533, %c_534 : (tensor<12x768x768xbf16>, tensor<1x768x768xbf16>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<12x768x768xbf16>
      %1495 = stablehlo.broadcast_in_dim %1486#5, dims = [1, 2, 3, 4] : (tensor<64x512x12x64xbf16>) -> tensor<1x64x512x12x64xbf16>
      %c_535 = stablehlo.constant dense<0> : tensor<i32>
      %c_536 = stablehlo.constant dense<0> : tensor<i32>
      %c_537 = stablehlo.constant dense<0> : tensor<i32>
      %c_538 = stablehlo.constant dense<0> : tensor<i32>
      %1496 = stablehlo.dynamic_update_slice %iterArg_468, %1495, %iterArg_462, %c_535, %c_536, %c_537, %c_538 : (tensor<12x64x512x12x64xbf16>, tensor<1x64x512x12x64xbf16>, tensor<i32>, tensor<i32>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<12x64x512x12x64xbf16>
      %1497 = stablehlo.broadcast_in_dim %1486#6, dims = [1, 2, 3, 4] : (tensor<64x512x12x64xbf16>) -> tensor<1x64x512x12x64xbf16>
      %c_539 = stablehlo.constant dense<0> : tensor<i32>
      %c_540 = stablehlo.constant dense<0> : tensor<i32>
      %c_541 = stablehlo.constant dense<0> : tensor<i32>
      %c_542 = stablehlo.constant dense<0> : tensor<i32>
      %1498 = stablehlo.dynamic_update_slice %iterArg_469, %1497, %iterArg_462, %c_539, %c_540, %c_541, %c_542 : (tensor<12x64x512x12x64xbf16>, tensor<1x64x512x12x64xbf16>, tensor<i32>, tensor<i32>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<12x64x512x12x64xbf16>
      %1499 = stablehlo.broadcast_in_dim %1486#7, dims = [1, 2, 3, 4] : (tensor<64x512x12x512xf32>) -> tensor<1x64x512x12x512xf32>
      %c_543 = stablehlo.constant dense<0> : tensor<i32>
      %c_544 = stablehlo.constant dense<0> : tensor<i32>
      %c_545 = stablehlo.constant dense<0> : tensor<i32>
      %c_546 = stablehlo.constant dense<0> : tensor<i32>
      %1500 = stablehlo.dynamic_update_slice %iterArg_470, %1499, %iterArg_462, %c_543, %c_544, %c_545, %c_546 : (tensor<12x64x512x12x512xf32>, tensor<1x64x512x12x512xf32>, tensor<i32>, tensor<i32>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<12x64x512x12x512xf32>
      %1501 = stablehlo.broadcast_in_dim %1486#8, dims = [1, 2, 3, 4] : (tensor<64x512x12x1xf32>) -> tensor<1x64x512x12x1xf32>
      %c_547 = stablehlo.constant dense<0> : tensor<i32>
      %c_548 = stablehlo.constant dense<0> : tensor<i32>
      %c_549 = stablehlo.constant dense<0> : tensor<i32>
      %c_550 = stablehlo.constant dense<0> : tensor<i32>
      %1502 = stablehlo.dynamic_update_slice %iterArg_471, %1501, %iterArg_462, %c_547, %c_548, %c_549, %c_550 : (tensor<12x64x512x12x1xf32>, tensor<1x64x512x12x1xf32>, tensor<i32>, tensor<i32>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<12x64x512x12x1xf32>
