module @jit_train_step attributes {mhlo.num_partitions = 4 : i32, mhlo.num_replicas = 1 : i32} {
  sdy.mesh @mesh = <["dp"=4]>
  sdy.mesh @empty_mesh = <[]>
  func.func public @main(%arg0: tensor<30522x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg1: tensor<512x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg2: tensor<2x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg3: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg4: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg5: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg6: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg7: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg8: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg9: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg10: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg11: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg12: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg13: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg14: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg15: tensor<12x3072x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg16: tensor<12x3072xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg17: tensor<12x768x3072xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg18: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg19: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg20: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg21: tensor<768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg22: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg23: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg24: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg25: tensor<30522x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg26: tensor<30522xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg27: tensor<i32> {sdy.sharding = #sdy.sharding<@empty_mesh, []>}, %arg28: tensor<i32> {sdy.sharding = #sdy.sharding<@empty_mesh, []>}, %arg29: tensor<i32> {sdy.sharding = #sdy.sharding<@empty_mesh, []>}, %arg30: tensor<30522x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg31: tensor<512x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg32: tensor<2x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg33: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg34: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg35: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg36: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg37: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg38: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg39: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg40: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg41: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg42: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg43: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg44: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg45: tensor<12x3072x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg46: tensor<12x3072xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg47: tensor<12x768x3072xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg48: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg49: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg50: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg51: tensor<768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg52: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg53: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg54: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg55: tensor<30522x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg56: tensor<30522xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg57: tensor<30522x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg58: tensor<512x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg59: tensor<2x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg60: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg61: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg62: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg63: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg64: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg65: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg66: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg67: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg68: tensor<12x768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg69: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg70: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg71: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg72: tensor<12x3072x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg73: tensor<12x3072xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg74: tensor<12x768x3072xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}, {}]>}, %arg75: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg76: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg77: tensor<12x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg78: tensor<768x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg79: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg80: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg81: tensor<768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg82: tensor<30522x768xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}, {}]>}, %arg83: tensor<30522xbf16> {sdy.sharding = #sdy.sharding<@mesh, [{}]>}, %arg84: tensor<64x512xi32> {sdy.sharding = #sdy.sharding<@mesh, [{"dp"}, {}]>}, %arg85: tensor<64x512xi32> {sdy.sharding = #sdy.sharding<@mesh, [{"dp"}, {}]>}, %arg86: tensor<64x512xi32> {sdy.sharding = #sdy.sharding<@mesh, [{"dp"}, {}]>}, %arg87: tensor<64x512xi32> {sdy.sharding = #sdy.sharding<@mesh, [{"dp"}, {}]>}, %arg88: tensor<2xui32>) -> (tensor<i32> {jax.result_info = "result[0]"}, tensor<30522x768xbf16> {jax.result_info = "result[1][0].bert.embeddings.word_embeddings.weight"}, tensor<512x768xbf16> {jax.result_info = "result[1][0].bert.embeddings.position_embeddings.weight"}, tensor<2x768xbf16> {jax.result_info = "result[1][0].bert.embeddings.token_type_embeddings.weight"}, tensor<768xbf16> {jax.result_info = "result[1][0].bert.embeddings.layer_norm.weight"}, tensor<768xbf16> {jax.result_info = "result[1][0].bert.embeddings.layer_norm.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.self_attention.query.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.self_attention.query.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.self_attention.key.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.self_attention.key.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.self_attention.value.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.self_attention.value.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.output.dense.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.output.dense.bias"}, tensor<12x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.output.layer_norm.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.attention.output.layer_norm.bias"}, tensor<12x3072x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.intermediate.dense.weight"}, tensor<12x3072xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.intermediate.dense.bias"}, tensor<12x768x3072xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.output.dense.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.output.dense.bias"}, tensor<12x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.output.layer_norm.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][0].bert.encoder.layers.output.layer_norm.bias"}, tensor<768x768xbf16> {jax.result_info = "result[1][0].mlm_head.dense.weight"}, tensor<768xbf16> {jax.result_info = "result[1][0].mlm_head.dense.bias"}, tensor<768xbf16> {jax.result_info = "result[1][0].mlm_head.layer_norm.weight"}, tensor<768xbf16> {jax.result_info = "result[1][0].mlm_head.layer_norm.bias"}, tensor<30522x768xbf16> {jax.result_info = "result[1][0].mlm_head.lm_head.pytree[0].weight"}, tensor<30522xbf16> {jax.result_info = "result[1][0].mlm_head.bias"}, tensor<i32> {jax.result_info = "result[1][1].opt_state.count"}, tensor<bf16> {jax.result_info = "result[1][1].opt_state.hyperparams['learning_rate']"}, tensor<i32> {jax.result_info = "result[1][1].opt_state.hyperparams_states['learning_rate'].count"}, tensor<i32> {jax.result_info = "result[1][1].opt_state.inner_state[1].count"}, tensor<30522x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.embeddings.word_embeddings.weight"}, tensor<512x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.embeddings.position_embeddings.weight"}, tensor<2x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.embeddings.token_type_embeddings.weight"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.embeddings.layer_norm.weight"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.embeddings.layer_norm.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.encoder.layers.attention.self_attention.query.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.encoder.layers.attention.self_attention.query.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.encoder.layers.attention.self_attention.key.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.encoder.layers.attention.self_attention.key.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.encoder.layers.attention.self_attention.value.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.encoder.layers.attention.self_attention.value.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.encoder.layers.attention.output.dense.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.encoder.layers.attention.output.dense.bias"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.encoder.layers.attention.output.layer_norm.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.encoder.layers.attention.output.layer_norm.bias"}, tensor<12x3072x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.encoder.layers.intermediate.dense.weight"}, tensor<12x3072xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.encoder.layers.intermediate.dense.bias"}, tensor<12x768x3072xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.encoder.layers.output.dense.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.encoder.layers.output.dense.bias"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.encoder.layers.output.layer_norm.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.bert.encoder.layers.output.layer_norm.bias"}, tensor<768x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.mlm_head.dense.weight"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.mlm_head.dense.bias"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.mlm_head.layer_norm.weight"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.mlm_head.layer_norm.bias"}, tensor<30522x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.mlm_head.lm_head.pytree[0].weight"}, tensor<30522xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].mu.mlm_head.bias"}, tensor<30522x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.embeddings.word_embeddings.weight"}, tensor<512x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.embeddings.position_embeddings.weight"}, tensor<2x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.embeddings.token_type_embeddings.weight"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.embeddings.layer_norm.weight"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.embeddings.layer_norm.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.encoder.layers.attention.self_attention.query.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.encoder.layers.attention.self_attention.query.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.encoder.layers.attention.self_attention.key.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.encoder.layers.attention.self_attention.key.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.encoder.layers.attention.self_attention.value.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.encoder.layers.attention.self_attention.value.bias"}, tensor<12x768x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.encoder.layers.attention.output.dense.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.encoder.layers.attention.output.dense.bias"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.encoder.layers.attention.output.layer_norm.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.encoder.layers.attention.output.layer_norm.bias"}, tensor<12x3072x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.encoder.layers.intermediate.dense.weight"}, tensor<12x3072xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.encoder.layers.intermediate.dense.bias"}, tensor<12x768x3072xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.encoder.layers.output.dense.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.encoder.layers.output.dense.bias"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.encoder.layers.output.layer_norm.weight"}, tensor<12x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.bert.encoder.layers.output.layer_norm.bias"}, tensor<768x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.mlm_head.dense.weight"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.mlm_head.dense.bias"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.mlm_head.layer_norm.weight"}, tensor<768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.mlm_head.layer_norm.bias"}, tensor<30522x768xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.mlm_head.lm_head.pytree[0].weight"}, tensor<30522xbf16> {jax.result_info = "result[1][1].opt_state.inner_state[1].nu.mlm_head.bias"}, tensor<i32> {jax.result_info = "result[1][2]['acc'][0]"}, tensor<i32> {jax.result_info = "result[1][2]['acc'][1]"}, tensor<f32> {jax.result_info = "result[1][2]['loss'][0]"}, tensor<i32> {jax.result_info = "result[1][2]['loss'][1]"}, tensor<i32> {jax.result_info = "result[1][2]['total_token']"}) {
    %0 = call @_threefry_split(%arg88) : (tensor<2xui32>) -> tensor<2x2xui32>
    %1 = stablehlo.slice %0 [1:2, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %2 = stablehlo.reshape %1 : (tensor<1x2xui32>) -> tensor<2xui32>
    %3 = stablehlo.iota dim = 0 : tensor<512xi32>
    %4 = stablehlo.broadcast_in_dim %3, dims = [1] : (tensor<512xi32>) -> tensor<1x512xi32>
    %5 = stablehlo.broadcast_in_dim %4, dims = [0, 1] : (tensor<1x512xi32>) -> tensor<64x512xi32>
    %6 = call @_threefry_split(%2) : (tensor<2xui32>) -> tensor<2x2xui32>
    %7 = stablehlo.slice %6 [0:1, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %8 = stablehlo.reshape %7 : (tensor<1x2xui32>) -> tensor<2xui32>
    %9 = call @_threefry_split(%8) : (tensor<2xui32>) -> tensor<2x2xui32>
    %10 = stablehlo.slice %9 [0:1, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %11 = stablehlo.reshape %10 : (tensor<1x2xui32>) -> tensor<2xui32>
    %12 = stablehlo.slice %9 [1:2, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %13 = stablehlo.reshape %12 : (tensor<1x2xui32>) -> tensor<2xui32>
    %14:2 = call @_take(%arg0, %arg84) : (tensor<30522x768xbf16>, tensor<64x512xi32>) -> (tensor<64x512x768xbf16>, tensor<64x512x1xi32>)
    %15:2 = call @_take_15(%arg1, %5) : (tensor<512x768xbf16>, tensor<64x512xi32>) -> (tensor<64x512x768xbf16>, tensor<64x512x1xi32>)
    %16 = stablehlo.add %14#0, %15#0 : tensor<64x512x768xbf16>
    %17:2 = call @_take_29(%arg2, %arg86) : (tensor<2x768xbf16>, tensor<64x512xi32>) -> (tensor<64x512x768xbf16>, tensor<64x512x1xi32>)
    %18 = stablehlo.add %16, %17#0 : tensor<64x512x768xbf16>
    %19 = stablehlo.convert %18 : (tensor<64x512x768xbf16>) -> tensor<64x512x768xf32>
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %20 = stablehlo.reduce(%19 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<64x512x768xf32>, tensor<f32>) -> tensor<64x512xf32>
    %21 = stablehlo.broadcast_in_dim %20, dims = [0, 1] : (tensor<64x512xf32>) -> tensor<64x512x1xf32>
    %cst_0 = stablehlo.constant dense<7.680000e+02> : tensor<f32>
    %22 = stablehlo.broadcast_in_dim %cst_0, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %23 = stablehlo.divide %21, %22 : tensor<64x512x1xf32>
    %24 = stablehlo.broadcast_in_dim %23, dims = [0, 1, 2] : (tensor<64x512x1xf32>) -> tensor<64x512x768xf32>
    %25 = stablehlo.subtract %19, %24 : tensor<64x512x768xf32>
    %26 = stablehlo.multiply %19, %19 : tensor<64x512x768xf32>
    %cst_1 = stablehlo.constant dense<2.000000e+00> : tensor<f32>
    %27 = stablehlo.broadcast_in_dim %cst_1, dims = [] : (tensor<f32>) -> tensor<64x512x768xf32>
    %28 = stablehlo.multiply %27, %19 : tensor<64x512x768xf32>
    %cst_2 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %29 = stablehlo.reduce(%26 init: %cst_2) applies stablehlo.add across dimensions = [2] : (tensor<64x512x768xf32>, tensor<f32>) -> tensor<64x512xf32>
    %30 = stablehlo.broadcast_in_dim %29, dims = [0, 1] : (tensor<64x512xf32>) -> tensor<64x512x1xf32>
    %cst_3 = stablehlo.constant dense<7.680000e+02> : tensor<f32>
    %31 = stablehlo.broadcast_in_dim %cst_3, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %32 = stablehlo.divide %30, %31 : tensor<64x512x1xf32>
    %33 = stablehlo.multiply %23, %23 : tensor<64x512x1xf32>
    %cst_4 = stablehlo.constant dense<2.000000e+00> : tensor<f32>
    %34 = stablehlo.broadcast_in_dim %cst_4, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %35 = stablehlo.multiply %34, %23 : tensor<64x512x1xf32>
    %36 = stablehlo.subtract %32, %33 : tensor<64x512x1xf32>
    %cst_5 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %37 = stablehlo.broadcast_in_dim %cst_5, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %38 = stablehlo.maximum %37, %36 : tensor<64x512x1xf32>
    %39 = stablehlo.compare  EQ, %36, %38,  FLOAT : (tensor<64x512x1xf32>, tensor<64x512x1xf32>) -> tensor<64x512x1xi1>
    %cst_6 = stablehlo.constant dense<1.000000e+00> : tensor<f32>
    %40 = stablehlo.broadcast_in_dim %cst_6, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %cst_7 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %41 = stablehlo.broadcast_in_dim %cst_7, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %42 = stablehlo.select %39, %40, %41 : tensor<64x512x1xi1>, tensor<64x512x1xf32>
    %cst_8 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %43 = stablehlo.broadcast_in_dim %cst_8, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %44 = stablehlo.compare  EQ, %43, %38,  FLOAT : (tensor<64x512x1xf32>, tensor<64x512x1xf32>) -> tensor<64x512x1xi1>
    %cst_9 = stablehlo.constant dense<2.000000e+00> : tensor<f32>
    %45 = stablehlo.broadcast_in_dim %cst_9, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %cst_10 = stablehlo.constant dense<1.000000e+00> : tensor<f32>
    %46 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %47 = stablehlo.select %44, %45, %46 : tensor<64x512x1xi1>, tensor<64x512x1xf32>
    %48 = stablehlo.divide %42, %47 : tensor<64x512x1xf32>
    %cst_11 = stablehlo.constant dense<9.99999996E-13> : tensor<f32>
    %49 = stablehlo.broadcast_in_dim %cst_11, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %50 = stablehlo.add %38, %49 : tensor<64x512x1xf32>
    %51 = stablehlo.rsqrt %50 : tensor<64x512x1xf32>
    %52 = stablehlo.divide %51, %50 : tensor<64x512x1xf32>
    %cst_12 = stablehlo.constant dense<-5.000000e-01> : tensor<f32>
    %53 = stablehlo.broadcast_in_dim %cst_12, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %54 = stablehlo.multiply %53, %52 : tensor<64x512x1xf32>
    %55 = stablehlo.broadcast_in_dim %51, dims = [0, 1, 2] : (tensor<64x512x1xf32>) -> tensor<64x512x768xf32>
    %56 = stablehlo.multiply %25, %55 : tensor<64x512x768xf32>
    %57 = stablehlo.convert %arg3 : (tensor<768xbf16>) -> tensor<768xf32>
    %58 = stablehlo.broadcast_in_dim %57, dims = [2] : (tensor<768xf32>) -> tensor<1x1x768xf32>
    %59 = stablehlo.broadcast_in_dim %58, dims = [0, 1, 2] : (tensor<1x1x768xf32>) -> tensor<64x512x768xf32>
    %60 = stablehlo.multiply %59, %56 : tensor<64x512x768xf32>
    %61 = stablehlo.convert %arg4 : (tensor<768xbf16>) -> tensor<768xf32>
    %62 = stablehlo.broadcast_in_dim %61, dims = [2] : (tensor<768xf32>) -> tensor<1x1x768xf32>
    %63 = stablehlo.broadcast_in_dim %62, dims = [0, 1, 2] : (tensor<1x1x768xf32>) -> tensor<64x512x768xf32>
    %64 = stablehlo.add %60, %63 : tensor<64x512x768xf32>
    %65 = stablehlo.convert %64 : (tensor<64x512x768xf32>) -> tensor<64x512x768xbf16>
    %cst_13 = stablehlo.constant dense<0.899999976> : tensor<f32>
    %66 = call @_bernoulli(%11, %cst_13) : (tensor<2xui32>, tensor<f32>) -> tensor<64x512x768xi1>
    %cst_14 = stablehlo.constant dense<8.984370e-01> : tensor<bf16>
    %67 = stablehlo.broadcast_in_dim %cst_14, dims = [] : (tensor<bf16>) -> tensor<64x512x768xbf16>
    %68 = stablehlo.divide %65, %67 : tensor<64x512x768xbf16>
    %c = stablehlo.constant dense<0> : tensor<i32>
    %69 = call @_where_65(%66, %68, %c) : (tensor<64x512x768xi1>, tensor<64x512x768xbf16>, tensor<i32>) -> tensor<64x512x768xbf16>
    %c_15 = stablehlo.constant dense<true> : tensor<i1>
    %70 = stablehlo.broadcast_in_dim %c_15, dims = [] : (tensor<i1>) -> tensor<512xi1>
    %71 = stablehlo.broadcast_in_dim %70, dims = [1] : (tensor<512xi1>) -> tensor<512x512xi1>
    %72 = stablehlo.broadcast_in_dim %71, dims = [1, 2] : (tensor<512x512xi1>) -> tensor<64x512x512xi1>
    %73 = stablehlo.broadcast_in_dim %arg85, dims = [0, 1] : (tensor<64x512xi32>) -> tensor<64x512x1xi32>
    %74 = stablehlo.convert %72 : (tensor<64x512x512xi1>) -> tensor<64x512x512xi32>
    %75 = stablehlo.broadcast_in_dim %73, dims = [0, 1, 2] : (tensor<64x512x1xi32>) -> tensor<64x512x512xi32>
    %76 = stablehlo.and %74, %75 : tensor<64x512x512xi32>
    %77 = call @_threefry_split_75(%13) : (tensor<2xui32>) -> tensor<12x2xui32>
    %cst_16 = stablehlo.constant dense<6.400000e+01> : tensor<f32>
    %78 = stablehlo.sqrt %cst_16 : tensor<f32>
    %79 = stablehlo.convert %78 : (tensor<f32>) -> tensor<bf16>
    %80 = stablehlo.broadcast_in_dim %76, dims = [0, 1, 3] : (tensor<64x512x512xi32>) -> tensor<64x512x1x512xi32>
    %cst_17 = stablehlo.constant dense<-3.389530e+38> : tensor<bf16>
    %81:2 = call @_where_89(%80, %cst_17) : (tensor<64x512x1x512xi32>, tensor<bf16>) -> (tensor<64x512x12x512xi1>, tensor<64x512x12x512xbf16>)
    %82:2 = call @_bernoulli_93() : () -> (tensor<1x1x1x1xf32>, tensor<1x1x1x1xf32>)
    %c_18 = stablehlo.constant dense<0> : tensor<i32>
    %83 = call @_where_97(%c_18) : (tensor<i32>) -> tensor<64x512x12x512xbf16>
    %84:2 = call @_bernoulli_99() : () -> (tensor<1x1x1xf32>, tensor<1x1x1xf32>)
    %c_19 = stablehlo.constant dense<0> : tensor<i32>
    %85 = call @_where_101(%c_19) : (tensor<i32>) -> tensor<64x512x768xbf16>
    %cst_20 = stablehlo.constant dense<1.000000e+00> : tensor<f32>
    %86 = stablehlo.broadcast_in_dim %cst_20, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %cst_21 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %87 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %cst_22 = stablehlo.constant dense<2.000000e+00> : tensor<f32>
    %88 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %cst_23 = stablehlo.constant dense<1.000000e+00> : tensor<f32>
    %89 = stablehlo.broadcast_in_dim %cst_23, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %cst_24 = stablehlo.constant dense<1.000000e+00> : tensor<bf16>
    %90 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<bf16>) -> tensor<bf16>
    %91:2 = call @_bernoulli_99() : () -> (tensor<1x1x1xf32>, tensor<1x1x1xf32>)
    %c_25 = stablehlo.constant dense<0> : tensor<i32>
    %92 = call @_where_101(%c_25) : (tensor<i32>) -> tensor<64x512x768xbf16>
    %cst_26 = stablehlo.constant dense<1.000000e+00> : tensor<f32>
    %93 = stablehlo.broadcast_in_dim %cst_26, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %cst_27 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %94 = stablehlo.broadcast_in_dim %cst_27, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %cst_28 = stablehlo.constant dense<2.000000e+00> : tensor<f32>
    %95 = stablehlo.broadcast_in_dim %cst_28, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %cst_29 = stablehlo.constant dense<1.000000e+00> : tensor<f32>
    %96 = stablehlo.broadcast_in_dim %cst_29, dims = [] : (tensor<f32>) -> tensor<64x512x1xf32>
    %cst_30 = stablehlo.constant dense<0.899999976> : tensor<f32>
    %cst_31 = stablehlo.constant dense<0.899999976> : tensor<f32>
    %cst_32 = stablehlo.constant dense<0.899999976> : tensor<f32>
    %cst_33 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %97 = stablehlo.broadcast_in_dim %cst_33, dims = [] : (tensor<bf16>) -> tensor<12x768x768xbf16>
    %cst_34 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %98 = stablehlo.broadcast_in_dim %cst_34, dims = [] : (tensor<bf16>) -> tensor<12x64x512x768xbf16>
    %cst_35 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %99 = stablehlo.broadcast_in_dim %cst_35, dims = [] : (tensor<bf16>) -> tensor<12x768x768xbf16>
    %cst_36 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %100 = stablehlo.broadcast_in_dim %cst_36, dims = [] : (tensor<bf16>) -> tensor<12x768x768xbf16>
    %cst_37 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %101 = stablehlo.broadcast_in_dim %cst_37, dims = [] : (tensor<bf16>) -> tensor<12x64x512x12x64xbf16>
    %cst_38 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %102 = stablehlo.broadcast_in_dim %cst_38, dims = [] : (tensor<bf16>) -> tensor<12x64x512x12x64xbf16>
    %cst_39 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %103 = stablehlo.broadcast_in_dim %cst_39, dims = [] : (tensor<f32>) -> tensor<12x64x512x12x512xf32>
    %cst_40 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %104 = stablehlo.broadcast_in_dim %cst_40, dims = [] : (tensor<f32>) -> tensor<12x64x512x12x1xf32>
    %cst_41 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %105 = stablehlo.broadcast_in_dim %cst_41, dims = [] : (tensor<f32>) -> tensor<12x64x512x12x1xf32>
    %c_42 = stablehlo.constant dense<false> : tensor<i1>
    %106 = stablehlo.broadcast_in_dim %c_42, dims = [] : (tensor<i1>) -> tensor<12x64x512x12x512xi1>
    %cst_43 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %107 = stablehlo.broadcast_in_dim %cst_43, dims = [] : (tensor<bf16>) -> tensor<12x64x512x12x512xbf16>
    %cst_44 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %108 = stablehlo.broadcast_in_dim %cst_44, dims = [] : (tensor<bf16>) -> tensor<12x64x512x12x64xbf16>
    %cst_45 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %109 = stablehlo.broadcast_in_dim %cst_45, dims = [] : (tensor<bf16>) -> tensor<12x768x768xbf16>
    %cst_46 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %110 = stablehlo.broadcast_in_dim %cst_46, dims = [] : (tensor<bf16>) -> tensor<12x64x512x768xbf16>
    %c_47 = stablehlo.constant dense<false> : tensor<i1>
    %111 = stablehlo.broadcast_in_dim %c_47, dims = [] : (tensor<i1>) -> tensor<12x64x512x768xi1>
    %cst_48 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %112 = stablehlo.broadcast_in_dim %cst_48, dims = [] : (tensor<f32>) -> tensor<12x64x512x768xf32>
    %cst_49 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %113 = stablehlo.broadcast_in_dim %cst_49, dims = [] : (tensor<f32>) -> tensor<12x64x512x1xf32>
    %cst_50 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %114 = stablehlo.broadcast_in_dim %cst_50, dims = [] : (tensor<f32>) -> tensor<12x64x512x1xf32>
    %cst_51 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %115 = stablehlo.broadcast_in_dim %cst_51, dims = [] : (tensor<f32>) -> tensor<12x64x512x1xf32>
    %cst_52 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %116 = stablehlo.broadcast_in_dim %cst_52, dims = [] : (tensor<f32>) -> tensor<12x64x512x1xf32>
    %cst_53 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %117 = stablehlo.broadcast_in_dim %cst_53, dims = [] : (tensor<f32>) -> tensor<12x64x512x768xf32>
    %cst_54 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %118 = stablehlo.broadcast_in_dim %cst_54, dims = [] : (tensor<f32>) -> tensor<12x64x512x768xf32>
    %cst_55 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %119 = stablehlo.broadcast_in_dim %cst_55, dims = [] : (tensor<f32>) -> tensor<12x1x1x768xf32>
    %cst_56 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %120 = stablehlo.broadcast_in_dim %cst_56, dims = [] : (tensor<bf16>) -> tensor<12x768x3072xbf16>
    %cst_57 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %121 = stablehlo.broadcast_in_dim %cst_57, dims = [] : (tensor<bf16>) -> tensor<12x64x512x768xbf16>
    %cst_58 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %122 = stablehlo.broadcast_in_dim %cst_58, dims = [] : (tensor<bf16>) -> tensor<12x64x512x3072xbf16>
    %cst_59 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %123 = stablehlo.broadcast_in_dim %cst_59, dims = [] : (tensor<bf16>) -> tensor<12x64x512x3072xbf16>
    %cst_60 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %124 = stablehlo.broadcast_in_dim %cst_60, dims = [] : (tensor<bf16>) -> tensor<12x64x512x3072xbf16>
    %cst_61 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %125 = stablehlo.broadcast_in_dim %cst_61, dims = [] : (tensor<bf16>) -> tensor<12x64x512x3072xbf16>
    %cst_62 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %126 = stablehlo.broadcast_in_dim %cst_62, dims = [] : (tensor<bf16>) -> tensor<12x64x512x3072xbf16>
    %cst_63 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %127 = stablehlo.broadcast_in_dim %cst_63, dims = [] : (tensor<bf16>) -> tensor<12x3072x768xbf16>
    %cst_64 = stablehlo.constant dense<0.000000e+00> : tensor<bf16>
    %128 = stablehlo.broadcast_in_dim %cst_64, dims = [] : (tensor<bf16>) -> tensor<12x64x512x3072xbf16>
    %c_65 = stablehlo.constant dense<false> : tensor<i1>
    %129 = stablehlo.broadcast_in_dim %c_65, dims = [] : (tensor<i1>) -> tensor<12x64x512x768xi1>
    %cst_66 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %130 = stablehlo.broadcast_in_dim %cst_66, dims = [] : (tensor<f32>) -> tensor<12x64x512x768xf32>
    %cst_67 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %131 = stablehlo.broadcast_in_dim %cst_67, dims = [] : (tensor<f32>) -> tensor<12x64x512x1xf32>
    %cst_68 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %132 = stablehlo.broadcast_in_dim %cst_68, dims = [] : (tensor<f32>) -> tensor<12x64x512x1xf32>
    %cst_69 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %133 = stablehlo.broadcast_in_dim %cst_69, dims = [] : (tensor<f32>) -> tensor<12x64x512x1xf32>
    %cst_70 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %134 = stablehlo.broadcast_in_dim %cst_70, dims = [] : (tensor<f32>) -> tensor<12x64x512x1xf32>
    %cst_71 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %135 = stablehlo.broadcast_in_dim %cst_71, dims = [] : (tensor<f32>) -> tensor<12x64x512x768xf32>
    %cst_72 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %136 = stablehlo.broadcast_in_dim %cst_72, dims = [] : (tensor<f32>) -> tensor<12x64x512x768xf32>
    %cst_73 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %137 = stablehlo.broadcast_in_dim %cst_73, dims = [] : (tensor<f32>) -> tensor<12x1x1x768xf32>
    %c_74 = stablehlo.constant dense<0> : tensor<i32>
    %138:84 = stablehlo.while(%iterArg = %arg5, %iterArg_417 = %arg6, %iterArg_418 = %arg7, %iterArg_419 = %arg8, %iterArg_420 = %arg9, %iterArg_421 = %arg10, %iterArg_422 = %arg11, %iterArg_423 = %arg12, %iterArg_424 = %arg13, %iterArg_425 = %arg14, %iterArg_426 = %arg15, %iterArg_427 = %arg16, %iterArg_428 = %arg17, %iterArg_429 = %arg18, %iterArg_430 = %arg19, %iterArg_431 = %arg20, %iterArg_432 = %77, %iterArg_433 = %91#0, %iterArg_434 = %91#1, %iterArg_435 = %cst_30, %iterArg_436 = %84#0, %iterArg_437 = %84#1, %iterArg_438 = %cst_31, %iterArg_439 = %82#0, %iterArg_440 = %82#1, %iterArg_441 = %cst_32, %iterArg_442 = %79, %iterArg_443 = %81#0, %iterArg_444 = %81#1, %iterArg_445 = %83, %iterArg_446 = %85, %iterArg_447 = %92, %iterArg_448 = %87, %iterArg_449 = %86, %iterArg_450 = %89, %iterArg_451 = %88, %iterArg_452 = %90, %iterArg_453 = %94, %iterArg_454 = %93, %iterArg_455 = %96, %iterArg_456 = %95, %iterArg_457 = %c_74, %iterArg_458 = %69, %iterArg_459 = %97, %iterArg_460 = %98, %iterArg_461 = %99, %iterArg_462 = %100, %iterArg_463 = %101, %iterArg_464 = %102, %iterArg_465 = %103, %iterArg_466 = %104, %iterArg_467 = %105, %iterArg_468 = %106, %iterArg_469 = %107, %iterArg_470 = %108, %iterArg_471 = %109, %iterArg_472 = %110, %iterArg_473 = %111, %iterArg_474 = %112, %iterArg_475 = %113, %iterArg_476 = %114, %iterArg_477 = %115, %iterArg_478 = %116, %iterArg_479 = %117, %iterArg_480 = %118, %iterArg_481 = %119, %iterArg_482 = %120, %iterArg_483 = %121, %iterArg_484 = %122, %iterArg_485 = %123, %iterArg_486 = %124, %iterArg_487 = %125, %iterArg_488 = %126, %iterArg_489 = %127, %iterArg_490 = %128, %iterArg_491 = %129, %iterArg_492 = %130, %iterArg_493 = %131, %iterArg_494 = %132, %iterArg_495 = %133, %iterArg_496 = %134, %iterArg_497 = %135, %iterArg_498 = %136, %iterArg_499 = %137) : tensor<12x768x768xbf16>, tensor<12x768xbf16>, tensor<12x768x768xbf16>, tensor<12x768xbf16>, tensor<12x768x768xbf16>, tensor<12x768xbf16>, tensor<12x768x768xbf16>, tensor<12x768xbf16>, tensor<12x768xbf16>, tensor<12x768xbf16>, tensor<12x3072x768xbf16>, tensor<12x3072xbf16>, tensor<12x768x3072xbf16>, tensor<12x768xbf16>, tensor<12x768xbf16>, tensor<12x768xbf16>, tensor<12x2xui32>, tensor<1x1x1xf32>, tensor<1x1x1xf32>, tensor<f32>, tensor<1x1x1xf32>, tensor<1x1x1xf32>, tensor<f32>, tensor<1x1x1x1xf32>, tensor<1x1x1x1xf32>, tensor<f32>, tensor<bf16>, tensor<64x512x12x512xi1>, tensor<64x512x12x512xbf16>, tensor<64x512x12x512xbf16>, tensor<64x512x768xbf16>, tensor<64x512x768xbf16>, tensor<64x512x1xf32>, tensor<64x512x1xf32>, tensor<64x512x1xf32>, tensor<64x512x1xf32>, tensor<bf16>, tensor<64x512x1xf32>, tensor<64x512x1xf32>, tensor<64x512x1xf32>, tensor<64x512x1xf32>, tensor<i32>, tensor<64x512x768xbf16>, tensor<12x768x768xbf16>, tensor<12x64x512x768xbf16>, tensor<12x768x768xbf16>, tensor<12x768x768xbf16>, tensor<12x64x512x12x64xbf16>, tensor<12x64x512x12x64xbf16>, tensor<12x64x512x12x512xf32>, tensor<12x64x512x12x1xf32>, tensor<12x64x512x12x1xf32>, tensor<12x64x512x12x512xi1>, tensor<12x64x512x12x512xbf16>, tensor<12x64x512x12x64xbf16>, tensor<12x768x768xbf16>, tensor<12x64x512x768xbf16>, tensor<12x64x512x768xi1>, tensor<12x64x512x768xf32>, tensor<12x64x512x1xf32>, tensor<12x64x512x1xf32>, tensor<12x64x512x1xf32>, tensor<12x64x512x1xf32>, tensor<12x64x512x768xf32>, tensor<12x64x512x768xf32>, tensor<12x1x1x768xf32>, tensor<12x768x3072xbf16>, tensor<12x64x512x768xbf16>, tensor<12x64x512x3072xbf16>, tensor<12x64x512x3072xbf16>, tensor<12x64x512x3072xbf16>, tensor<12x64x512x3072xbf16>, tensor<12x64x512x3072xbf16>, tensor<12x3072x768xbf16>, tensor<12x64x512x3072xbf16>, tensor<12x64x512x768xi1>, tensor<12x64x512x768xf32>, tensor<12x64x512x1xf32>, tensor<12x64x512x1xf32>, tensor<12x64x512x1xf32>, tensor<12x64x512x1xf32>, tensor<12x64x512x768xf32>, tensor<12x64x512x768xf32>, tensor<12x1x1x768xf32>
    cond {
      %c_500 = stablehlo.constant dense<12> : tensor<i32>
      %1457 = stablehlo.compare  LT, %iterArg_457, %c_500,  SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1>
      stablehlo.return %1457 : tensor<i1>
    } do {
      %c_500 = stablehlo.constant dense<0> : tensor<i32>
      %c_501 = stablehlo.constant dense<0> : tensor<i32>
      %1457 = stablehlo.dynamic_slice %iterArg, %iterArg_457, %c_500, %c_501, sizes = [1, 768, 768] : (tensor<12x768x768xbf16>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<1x768x768xbf16>
      %1458 = stablehlo.reshape %1457 : (tensor<1x768x768xbf16>) -> tensor<768x768xbf16>
      %c_502 = stablehlo.constant dense<0> : tensor<i32>
      %1459 = stablehlo.dynamic_slice %iterArg_417, %iterArg_457, %c_502, sizes = [1, 768] : (tensor<12x768xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x768xbf16>
      %1460 = stablehlo.reshape %1459 : (tensor<1x768xbf16>) -> tensor<768xbf16>
      %c_503 = stablehlo.constant dense<0> : tensor<i32>
      %c_504 = stablehlo.constant dense<0> : tensor<i32>
      %1461 = stablehlo.dynamic_slice %iterArg_418, %iterArg_457, %c_503, %c_504, sizes = [1, 768, 768] : (tensor<12x768x768xbf16>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<1x768x768xbf16>
      %1462 = stablehlo.reshape %1461 : (tensor<1x768x768xbf16>) -> tensor<768x768xbf16>
      %c_505 = stablehlo.constant dense<0> : tensor<i32>
      %1463 = stablehlo.dynamic_slice %iterArg_419, %iterArg_457, %c_505, sizes = [1, 768] : (tensor<12x768xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x768xbf16>
      %1464 = stablehlo.reshape %1463 : (tensor<1x768xbf16>) -> tensor<768xbf16>
      %c_506 = stablehlo.constant dense<0> : tensor<i32>
      %c_507 = stablehlo.constant dense<0> : tensor<i32>
      %1465 = stablehlo.dynamic_slice %iterArg_420, %iterArg_457, %c_506, %c_507, sizes = [1, 768, 768] : (tensor<12x768x768xbf16>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<1x768x768xbf16>
      %1466 = stablehlo.reshape %1465 : (tensor<1x768x768xbf16>) -> tensor<768x768xbf16>
      %c_508 = stablehlo.constant dense<0> : tensor<i32>
      %1467 = stablehlo.dynamic_slice %iterArg_421, %iterArg_457, %c_508, sizes = [1, 768] : (tensor<12x768xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x768xbf16>
      %1468 = stablehlo.reshape %1467 : (tensor<1x768xbf16>) -> tensor<768xbf16>
      %c_509 = stablehlo.constant dense<0> : tensor<i32>
      %c_510 = stablehlo.constant dense<0> : tensor<i32>
      %1469 = stablehlo.dynamic_slice %iterArg_422, %iterArg_457, %c_509, %c_510, sizes = [1, 768, 768] : (tensor<12x768x768xbf16>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<1x768x768xbf16>
      %1470 = stablehlo.reshape %1469 : (tensor<1x768x768xbf16>) -> tensor<768x768xbf16>
      %c_511 = stablehlo.constant dense<0> : tensor<i32>
      %1471 = stablehlo.dynamic_slice %iterArg_423, %iterArg_457, %c_511, sizes = [1, 768] : (tensor<12x768xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x768xbf16>
      %1472 = stablehlo.reshape %1471 : (tensor<1x768xbf16>) -> tensor<768xbf16>
      %c_512 = stablehlo.constant dense<0> : tensor<i32>
      %1473 = stablehlo.dynamic_slice %iterArg_424, %iterArg_457, %c_512, sizes = [1, 768] : (tensor<12x768xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x768xbf16>
      %1474 = stablehlo.reshape %1473 : (tensor<1x768xbf16>) -> tensor<768xbf16>
      %c_513 = stablehlo.constant dense<0> : tensor<i32>
      %1475 = stablehlo.dynamic_slice %iterArg_425, %iterArg_457, %c_513, sizes = [1, 768] : (tensor<12x768xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x768xbf16>
      %1476 = stablehlo.reshape %1475 : (tensor<1x768xbf16>) -> tensor<768xbf16>
      %c_514 = stablehlo.constant dense<0> : tensor<i32>
      %c_515 = stablehlo.constant dense<0> : tensor<i32>
      %1477 = stablehlo.dynamic_slice %iterArg_426, %iterArg_457, %c_514, %c_515, sizes = [1, 3072, 768] : (tensor<12x3072x768xbf16>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<1x3072x768xbf16>
      %1478 = stablehlo.reshape %1477 : (tensor<1x3072x768xbf16>) -> tensor<3072x768xbf16>
      %c_516 = stablehlo.constant dense<0> : tensor<i32>
      %1479 = stablehlo.dynamic_slice %iterArg_427, %iterArg_457, %c_516, sizes = [1, 3072] : (tensor<12x3072xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x3072xbf16>
      %1480 = stablehlo.reshape %1479 : (tensor<1x3072xbf16>) -> tensor<3072xbf16>
      %c_517 = stablehlo.constant dense<0> : tensor<i32>
      %c_518 = stablehlo.constant dense<0> : tensor<i32>
      %1481 = stablehlo.dynamic_slice %iterArg_428, %iterArg_457, %c_517, %c_518, sizes = [1, 768, 3072] : (tensor<12x768x3072xbf16>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<1x768x3072xbf16>
      %1482 = stablehlo.reshape %1481 : (tensor<1x768x3072xbf16>) -> tensor<768x3072xbf16>
      %c_519 = stablehlo.constant dense<0> : tensor<i32>
      %1483 = stablehlo.dynamic_slice %iterArg_429, %iterArg_457, %c_519, sizes = [1, 768] : (tensor<12x768xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x768xbf16>
      %1484 = stablehlo.reshape %1483 : (tensor<1x768xbf16>) -> tensor<768xbf16>
      %c_520 = stablehlo.constant dense<0> : tensor<i32>
      %1485 = stablehlo.dynamic_slice %iterArg_430, %iterArg_457, %c_520, sizes = [1, 768] : (tensor<12x768xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x768xbf16>
      %1486 = stablehlo.reshape %1485 : (tensor<1x768xbf16>) -> tensor<768xbf16>
      %c_521 = stablehlo.constant dense<0> : tensor<i32>
      %1487 = stablehlo.dynamic_slice %iterArg_431, %iterArg_457, %c_521, sizes = [1, 768] : (tensor<12x768xbf16>, tensor<i32>, tensor<i32>) -> tensor<1x768xbf16>
      %1488 = stablehlo.reshape %1487 : (tensor<1x768xbf16>) -> tensor<768xbf16>
      %c_522 = stablehlo.constant dense<0> : tensor<i32>
      %1489 = stablehlo.dynamic_slice %iterArg_432, %iterArg_457, %c_522, sizes = [1, 2] : (tensor<12x2xui32>, tensor<i32>, tensor<i32>) -> tensor<1x2xui32>
      %1490 = stablehlo.reshape %1489 : (tensor<1x2xui32>) -> tensor<2xui32>
      %1491:42 = func.call @closed_call(%iterArg_433, %iterArg_434, %iterArg_435, %iterArg_436, %iterArg_437, %iterArg_438, %iterArg_439, %iterArg_440, %iterArg_441, %iterArg_442, %iterArg_443, %iterArg_444, %iterArg_445, %iterArg_446, %iterArg_447, %iterArg_448, %iterArg_449, %iterArg_450, %iterArg_451, %iterArg_452, %iterArg_453, %iterArg_454, %iterArg_455, %iterArg_456, %iterArg_458, %1458, %1460, %1462, %1464, %1466, %1468, %1470, %1472, %1474, %1476, %1478, %1480, %1482, %1484, %1486, %1488, %1490) : (tensor<1x1x1xf32>, tensor<1x1x1xf32>, tensor<f32>, tensor<1x1x1xf32>, tensor<1x1x1xf32>, tensor<f32>, tensor<1x1x1x1xf32>, tensor<1x1x1x1xf32>, tensor<f32>, tensor<bf16>, tensor<64x512x12x512xi1>, tensor<64x512x12x512xbf16>, tensor<64x512x12x512xbf16>, tensor<64x512x768xbf16>, tensor<64x512x768xbf16>, tensor<64x512x1xf32>, tensor<64x512x1xf32>, tensor<64x512x1xf32>, tensor<64x512x1xf32>, tensor<bf16>, tensor<64x512x1xf32>, tensor<64x512x1xf32>, tensor<64x512x1xf32>, tensor<64x512x1xf32>, tensor<64x512x768xbf16>, tensor<768x768xbf16>, tensor<768xbf16>, tensor<768x768xbf16>, tensor<768xbf16>, tensor<768x768xbf16>, tensor<768xbf16>, tensor<768x768xbf16>, tensor<768xbf16>, tensor<768xbf16>, tensor<768xbf16>, tensor<3072x768xbf16>, tensor<3072xbf16>, tensor<768x3072xbf16>, tensor<768xbf16>, tensor<768xbf16>, tensor<768xbf16>, tensor<2xui32>) -> (tensor<64x512x768xbf16>, tensor<768x768xbf16>, tensor<64x512x768xbf16>, tensor<768x768xbf16>, tensor<768x768xbf16>, tensor<64x512x12x64xbf16>, tensor<64x512x12x64xbf16>, tensor<64x512x12x512xf32>, tensor<64x512x12x1xf32>, tensor<64x512x12x1xf32>, tensor<64x512x12x512xi1>, tensor<64x512x12x512xbf16>, tensor<64x512x12x64xbf16>, tensor<768x768xbf16>, tensor<64x512x768xbf16>, tensor<64x512x768xi1>, tensor<64x512x768xf32>, tensor<64x512x1xf32>, tensor<64x512x1xf32>, tensor<64x512x1xf32>, tensor<64x512x1xf32>, tensor<64x512x768xf32>, tensor<64x512x768xf32>, tensor<1x1x768xf32>, tensor<768x3072xbf16>, tensor<64x512x768xbf16>, tensor<64x512x3072xbf16>, tensor<64x512x3072xbf16>, tensor<64x512x3072xbf16>, tensor<64x512x3072xbf16>, tensor<64x512x3072xbf16>, tensor<3072x768xbf16>, tensor<64x512x3072xbf16>, tensor<64x512x768xi1>, tensor<64x512x768xf32>, tensor<64x512x1xf32>, tensor<64x512x1xf32>, tensor<64x512x1xf32>, tensor<64x512x1xf32>, tensor<64x512x768xf32>, tensor<64x512x768xf32>, tensor<1x1x768xf32>)
      %1492 = stablehlo.broadcast_in_dim %1491#1, dims = [1, 2] : (tensor<768x768xbf16>) -> tensor<1x768x768xbf16>
      %c_523 = stablehlo.constant dense<0> : tensor<i32>
      %c_524 = stablehlo.constant dense<0> : tensor<i32>
      %1493 = stablehlo.dynamic_update_slice %iterArg_459, %1492, %iterArg_457, %c_523, %c_524 : (tensor<12x768x768xbf16>, tensor<1x768x768xbf16>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<12x768x768xbf16>
      %1494 = stablehlo.broadcast_in_dim %1491#2, dims = [1, 2, 3] : (tensor<64x512x768xbf16>) -> tensor<1x64x512x768xbf16>
      %c_525 = stablehlo.constant dense<0> : tensor<i32>
      %c_526 = stablehlo.constant dense<0> : tensor<i32>
      %c_527 = stablehlo.constant dense<0> : tensor<i32>
      %1495 = stablehlo.dynamic_update_slice %iterArg_460, %1494, %iterArg_457, %c_525, %c_526, %c_527 : (tensor<12x64x512x768xbf16>, tensor<1x64x512x768xbf16>, tensor<i32>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<12x64x512x768xbf16>
      %1496 = stablehlo.broadcast_in_dim %1491#3, dims = [1, 2] : (tensor<768x768xbf16>) -> tensor<1x768x768xbf16>
      %c_528 = stablehlo.constant dense<0> : tensor<i32>
      %c_529 = stablehlo.constant dense<0> : tensor<i32>
      %1497 = stablehlo.dynamic_update_slice %iterArg_461, %1496, %iterArg_457, %c_528, %c_529 : (tensor<12x768x768xbf16>, tensor<1x768x768xbf16>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<12x768x768xbf16>
      %1498 = stablehlo.broadcast_in_dim %1491#4, dims = [1, 2] : (tensor<768x768xbf16>) -> tensor<1x768x768xbf16>
      %c_530 = stablehlo.constant dense<0> : tensor<i32>
      %c_531 = stablehlo.constant dense<0> : tensor<i32>
      %1499 = stablehlo.dynamic_update_slice %iterArg_462, %1498, %iterArg_457, %c_530, %c_531 : (tensor<12x768x768xbf16>, tensor<1x768x768xbf16>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<12x768x768xbf16>
      %1500 = stablehlo.broadcast_in_dim %1491#5, dims = [1, 2, 3, 4] : (tensor<64x512x12x64xbf16>) -> tensor<1x64x512x12x64xbf16>
      %c_532 = stablehlo.constant dense<0> : tensor<i32>
      %c_533 = stablehlo.constant dense<0> : tensor<i32>
      %c_534 = stablehlo.constant dense<0> : tensor<i32>
      %c_535 = stablehlo.constant dense<0> : tensor<i32>
      %1501 = stablehlo.dynamic_update_slice %iterArg_463, %1500, %iterArg_457, %c_532, %c_533, %c_534, %c_535 : (tensor<12x64x512x12x64xbf16>, tensor<1x64x512x12x64xbf16>, tensor<i32>, tensor<i32>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<12x64x512x12x64xbf16>
      %1502 = stablehlo.broadcast_in_dim %1491#6, dims = [1, 2, 3, 4] : (tensor<64x512x12x64xbf16>) -> tensor<1x64x512x12x64xbf16>
      %c_536 = stablehlo.constant dense<0> : tensor<i32>
      %c_537 = stablehlo.constant dense<0> : tensor<i32>
      %c_538 = stablehlo.constant dense<0> : tensor<i32>
      %c_539 = stablehlo.constant dense<0> : tensor<i32>
